1033087886/esp32-cam/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <ArduinoWebsockets.h>
#include <tiny_websockets/network/tcp_client.hpp>
#include "esp_camera.h"
#include <time.h>
#include <string.h>
#include <ctype.h>
#include <memory>
#include "esp_netif.h"
#include "lwip/ip6_addr.h"
#include "lwip/sockets.h"
#include "esp_tls.h"
#if __has_include(<esp32/spiram.h>)
#include <esp32/spiram.h>
#define HAS_SPIRAM_CHIP_API 1
#else
#define HAS_SPIRAM_CHIP_API 0
#endif

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

using namespace websockets;

class EspTlsSecuredTcpClient : public websockets::network::TcpClient {
public:
  explicit EspTlsSecuredTcpClient(const char* caCert)
    : _tls(nullptr), _connected(false), _caCert(caCert) {
    _keepAlive.keep_alive_enable = true;
    _keepAlive.keep_alive_idle = 5;
    _keepAlive.keep_alive_interval = 5;
    _keepAlive.keep_alive_count = 3;
  }

  bool connect(const WSString& host, int port) override {
    close();
    _host = host;

    esp_tls_cfg_t cfg = {};
    cfg.timeout_ms = 10000;
    cfg.keep_alive_cfg = &_keepAlive;
    cfg.common_name = _host.c_str();

    if (_caCert != nullptr && strlen(_caCert) > 0) {
      cfg.cacert_buf = reinterpret_cast<const unsigned char*>(_caCert);
      cfg.cacert_bytes = strlen(_caCert) + 1;
    }

    _tls = esp_tls_init();
    if (_tls == nullptr) {
      return false;
    }

    int ret = esp_tls_conn_new_sync(_host.c_str(), _host.length(), port, &cfg, _tls);
    if (ret != 1) {
      esp_tls_conn_destroy(_tls);
      _tls = nullptr;
      _connected = false;
      return false;
    }

    _connected = true;
    return true;
  }

  bool poll() override {
    if (!_connected || _tls == nullptr) return false;

    int avail = esp_tls_get_bytes_avail(_tls);
    if (avail > 0) return true;

    int sockfd = -1;
    if (esp_tls_get_conn_sockfd(_tls, &sockfd) != ESP_OK || sockfd < 0) return false;

    fd_set readSet;
    FD_ZERO(&readSet);
    FD_SET(sockfd, &readSet);
    timeval tv = {};
    tv.tv_sec = 0;
    tv.tv_usec = 0;

    int rc = lwip_select(sockfd + 1, &readSet, nullptr, nullptr, &tv);
    return rc > 0;
  }

  bool available() override {
    return _connected && _tls != nullptr;
  }

  void send(const WSString& data) override {
    send(reinterpret_cast<const uint8_t*>(data.c_str()), data.size());
  }

  void send(const WSString&& data) override {
    send(reinterpret_cast<const uint8_t*>(data.c_str()), data.size());
  }

  void send(const uint8_t* data, const uint32_t len) override {
    if (!_connected || _tls == nullptr || data == nullptr || len == 0) return;

    uint32_t total = 0;
    while (total < len) {
      int written = esp_tls_conn_write(
        _tls,
        reinterpret_cast<const char*>(data + total),
        static_cast<size_t>(len - total)
      );
      if (written <= 0) {
        _connected = false;
        return;
      }
      total += static_cast<uint32_t>(written);
    }
  }

  WSString readLine() override {
    WSString line;
    if (!_connected || _tls == nullptr) return line;

    const uint32_t timeoutMs = 8000;
    unsigned long start = millis();
    while (_connected && millis() - start < timeoutMs) {
      char ch = 0;
      int ret = esp_tls_conn_read(_tls, &ch, 1);
      if (ret == 1) {
        line += ch;
        if (ch == '\n') {
          break;
        }
      } else if (ret == 0) {
        _connected = false;
        break;
      } else {
        delay(1);
      }
    }
    return line;
  }

  uint32_t read(uint8_t* buffer, const uint32_t len) override {
    if (!_connected || _tls == nullptr || buffer == nullptr || len == 0) return 0;
    int ret = esp_tls_conn_read(_tls, reinterpret_cast<char*>(buffer), len);
    if (ret <= 0) {
      if (ret == 0) {
        _connected = false;
      }
      return 0;
    }
    return static_cast<uint32_t>(ret);
  }

  void close() override {
    if (_tls != nullptr) {
      esp_tls_conn_destroy(_tls);
      _tls = nullptr;
    }
    _connected = false;
  }

  ~EspTlsSecuredTcpClient() override {
    close();
  }

protected:
  int getSocket() const override {
    return -1;
  }

private:
  esp_tls_t* _tls;
  bool _connected;
  const char* _caCert;
  WSString _host;
  tls_keep_alive_cfg_t _keepAlive;
};

void connectWiFi();
void doPortalAuth();
void testInternet();
void setupMqttTransport();
void syncTimeIfNeeded();
void connectMQTT();
void onWiFiEvent(WiFiEvent_t event);
void requestIPv6(const char* reason);
void refreshIPv6Status(bool verbose);
const char* classifyIPv6Type(const esp_ip6_addr_t& addr);
int ipv6TypeScore(const char* type);
void mqttCallback(char* topic, byte* payload, unsigned int length);
void publishHeartbeat();
void publishLightState();
void setFlashBrightness(uint8_t value, bool reportState);
String decodeCommandPayload(byte* payload, unsigned int length);
bool parseBrightnessCommand(String cmd, uint8_t& outValue);
bool initCamera();
void connectStreamWs();
void sendStreamFrameIfReady();
void setupTopics();
void setupFlashPwm();
void publishAck(const char* msg);
String extractJsonValue(const String& json, const String& key);
void printMemoryInfo(const char* stage);
const char* psramChipSizeText(int chipEnum);

// WiFi settings
// const char* ssid = "Keropok";
// const char* password = "ssz1151220817";
const char* ssid = "Xiaomi 13 Ultra";
const char* password = "1033087886";
// Optional captive portal auth (from ESP32-mqtt project workflow)
const bool enablePortalAuth = false;
const char* portalAuthBaseUrl = "http://192.168.100.2:8080/wportal/Onekey";
const unsigned long authInterval = 14100000UL;  // 235 minutes
unsigned long previousAuthTime = 0;

// MQTT settings
const char* mqttHost = "hea1fbf1.ala.cn-hangzhou.emqxsl.cn";
const uint16_t mqttPort = 8883;
const char* mqttUsername = "rose";
const char* mqttPassword = "123456";
const bool mqttUseTls = true;

// Fill CA cert only when mqttUseTls=true and broker uses 8883
const char* mqttCaCert = R"EOF(
-----BEGIN CERTIFICATE-----
MIIDjjCCAnagAwIBAgIQAzrx5qcRqaC7KGSxHQn65TANBgkqhkiG9w0BAQsFADBh
MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBH
MjAeFw0xMzA4MDExMjAwMDBaFw0zODAxMTUxMjAwMDBaMGExCzAJBgNVBAYTAlVT
MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdpY2VydC5j
b20xIDAeBgNVBAMTF0RpZ2lDZXJ0IEdsb2JhbCBSb290IEcyMIIBIjANBgkqhkiG
9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuzfNNNx7a8myaJCtSnX/RrohCgiN9RlUyfuI
2/Ou8jqJkTx65qsGGmvPrC3oXgkkRLpimn7Wo6h+4FR1IAWsULecYxpsMNzaHxmx
1x7e/dfgy5SDN67sH0NO3Xss0r0upS/kqbitOtSZpLYl6ZtrAGCSYP9PIUkY92eQ
q2EGnI/yuum06ZIya7XzV+hdG82MHauVBJVJ8zUtluNJbd134/tJS7SsVQepj5Wz
tCO7TG1F8PapspUwtP1MVYwnSlcUfIKdzXOS0xZKBgyMUNGPHgm+F6HmIcr9g+UQ
vIOlCsRnKPZzFBQ9RnbDhxSJITRNrw9FDKZJobq7nMWxM4MphQIDAQABo0IwQDAP
BgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNVHQ4EFgQUTiJUIBiV
5uNu5g/6+rkS7QYXjzkwDQYJKoZIhvcNAQELBQADggEBAGBnKJRvDkhj6zHd6mcY
1Yl9PMWLSn/pvtsrF9+wX3N3KjITOYFnQoQj8kVnNeyIv/iPsGEMNKSuIEyExtv4
NeF22d+mQrvHRAiGfzZ0JFrabA0UWTW98kndth/Jsw1HKj2ZL7tcu7XUIOGZX1NG
Fdtom/DzMNU+MeKNhJ7jitralj41E6Vf8PlwUHBHQRFXGU7Aj64GxJUTFy8bJZ91
8rGOmaFvE7FBcf6IKshPECBV1/MUReXgRPTqh5Uykw7+U0b6LJ3/iyK5S9kJRaTe
pLiaWN0bfVKfjllDiIGknibVb63dDcY3fe0Dkhvld1927jyNxF1WW6LZZm6zNTfl
MrY=
-----END CERTIFICATE-----
)EOF";

const char* deviceId = "esp32cam-01";

