1033087886/esp32-cam/src/main.cpp
const unsigned long wifiReconnectInterval = 5000UL;
const unsigned long mqttReconnectInterval = 5000UL;
const unsigned long mqttHeartbeatInterval = 30000UL;
const unsigned long wsReconnectInterval = 3000UL;
const unsigned long streamInterval = 100UL;  // ~10 FPS target (quality-first)
const unsigned long streamSendWarmupMs = 1000UL;
const unsigned long streamStatsInterval = 5000UL;
const size_t streamPreferredMaxFrameBytes = 85000;
const uint8_t streamJpegQualityPsram = 8;      // smaller value => higher quality/larger frame
const uint8_t streamJpegQualityNoPsram = 12;
const uint8_t streamJpegQualityMax = 12;
const unsigned long wsPingInterval = 15000UL;
const unsigned long ipv6RetryInterval = 4000UL;
const uint8_t ipv6MaxRetry = 15;
const framesize_t streamFrameSizePsram = FRAMESIZE_VGA;
const framesize_t streamFrameSizeNoPsram = FRAMESIZE_QVGA;

// Stream URL copied from the HTML reference file
const char* streamWsUrl = "wss://esp.rose980.eu.cc:443/esp32";
const char* streamWsHost = "esp.rose980.eu.cc";
const uint16_t streamWsPort = 443;
const char* streamWsPath = "/esp32";
const char* streamWsCaCert = R"EOF(
-----BEGIN CERTIFICATE-----
MIIG1TCCBL2gAwIBAgIQbFWr29AHksedBwzYEZ7WvzANBgkqhkiG9w0BAQwFADCB
iDELMAkGA1UEBhMCVVMxEzARBgNVBAgTCk5ldyBKZXJzZXkxFDASBgNVBAcTC0pl
cnNleSBDaXR5MR4wHAYDVQQKExVUaGUgVVNFUlRSVVNUIE5ldHdvcmsxLjAsBgNV
BAMTJVVTRVJUcnVzdCBSU0EgQ2VydGlmaWNhdGlvbiBBdXRob3JpdHkwHhcNMjAw
MTMwMDAwMDAwWhcNMzAwMTI5MjM1OTU5WjBLMQswCQYDVQQGEwJBVDEQMA4GA1UE
ChMHWmVyb1NTTDEqMCgGA1UEAxMhWmVyb1NTTCBSU0EgRG9tYWluIFNlY3VyZSBT
aXRlIENBMIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAhmlzfqO1Mdgj
4W3dpBPTVBX1AuvcAyG1fl0dUnw/MeueCWzRWTheZ35LVo91kLI3DDVaZKW+TBAs
JBjEbYmMwcWSTWYCg5334SF0+ctDAsFxsX+rTDh9kSrG/4mp6OShubLaEIUJiZo4
t873TuSd0Wj5DWt3DtpAG8T35l/v+xrN8ub8PSSoX5Vkgw+jWf4KQtNvUFLDq8mF
WhUnPL6jHAADXpvs4lTNYwOtx9yQtbpxwSt7QJY1+ICrmRJB6BuKRt/jfDJF9Jsc
RQVlHIxQdKAJl7oaVnXgDkqtk2qddd3kCDXd74gv813G91z7CjsGyJ93oJIlNS3U
gFbD6V54JMgZ3rSmotYbz98oZxX7MKbtCm1aJ/q+hTv2YK1yMxrnfcieKmOYBbFD
hnW5O6RMA703dBK92j6XRN2EttLkQuujZgy+jXRKtaWMIlkNkWJmOiHmErQngHvt
iNkIcjJumq1ddFX4iaTI40a6zgvIBtxFeDs2RfcaH73er7ctNUUqgQT5rFgJhMmF
x76rQgB5OZUkodb5k2ex7P+Gu4J86bS15094UuYcV09hVeknmTh5Ex9CBKipLS2W
2wKBakf+aVYnNCU6S0nASqt2xrZpGC1v7v6DhuepyyJtn3qSV2PoBiU5Sql+aARp
wUibQMGm44gjyNDqDlVp+ShLQlUH9x8CAwEAAaOCAXUwggFxMB8GA1UdIwQYMBaA
FFN5v1qqK0rPVIDh2JvAnfKyA2bLMB0GA1UdDgQWBBTI2XhootkZaNU9ct5fCj7c
tYaGpjAOBgNVHQ8BAf8EBAMCAYYwEgYDVR0TAQH/BAgwBgEB/wIBADAdBgNVHSUE
FjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwIgYDVR0gBBswGTANBgsrBgEEAbIxAQIC
TjAIBgZngQwBAgEwUAYDVR0fBEkwRzBFoEOgQYY/aHR0cDovL2NybC51c2VydHJ1
c3QuY29tL1VTRVJUcnVzdFJTQUNlcnRpZmljYXRpb25BdXRob3JpdHkuY3JsMHYG
CCsGAQUFBwEBBGowaDA/BggrBgEFBQcwAoYzaHR0cDovL2NydC51c2VydHJ1c3Qu
Y29tL1VTRVJUcnVzdFJTQUFkZFRydXN0Q0EuY3J0MCUGCCsGAQUFBzABhhlodHRw
Oi8vb2NzcC51c2VydHJ1c3QuY29tMA0GCSqGSIb3DQEBDAUAA4ICAQAVDwoIzQDV
ercT0eYqZjBNJ8VNWwVFlQOtZERqn5iWnEVaLZZdzxlbvz2Fx0ExUNuUEgYkIVM4
YocKkCQ7hO5noicoq/DrEYH5IuNcuW1I8JJZ9DLuB1fYvIHlZ2JG46iNbVKA3ygA
Ez86RvDQlt2C494qqPVItRjrz9YlJEGT0DrttyApq0YLFDzf+Z1pkMhh7c+7fXeJ
qmIhfJpduKc8HEQkYQQShen426S3H0JrIAbKcBCiyYFuOhfyvuwVCFDfFvrjADjd
4jX1uQXd161IyFRbm89s2Oj5oU1wDYz5sx+hoCuh6lSs+/uPuWomIq3y1GDFNafW
+LsHBU16lQo5Q2yh25laQsKRgyPmMpHJ98edm6y2sHUabASmRHxvGiuwwE25aDU0
2SAeepyImJ2CzB80YG7WxlynHqNhpE7xfC7PzQlLgmfEHdU+tHFeQazRQnrFkW2W
kqRGIq7cKRnyypvjPMkjeiV9lRdAM9fSJvsB3svUuu1coIG1xxI1yegoGM4r5QP4
RGIVvYaiI76C0djoSbQ/dkIUUXQuB8AL5jyH34g3BZaaXyvpmnV4ilppMXVAnAYG
ON51WhJ6W0xNdNJwzYASZYH+tmCWI+N60Gv2NNMGHwMZ7e9bXgzUCZH5FaBFDGR5
S9VWqHB73Q+OyIVvIbKYcSc2w/aSuFKGSA==
-----END CERTIFICATE-----
)EOF";

// ESP32-CAM (AI Thinker) pins
#define PWDN_GPIO_NUM 32
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 0
#define SIOD_GPIO_NUM 26
#define SIOC_GPIO_NUM 27
#define Y9_GPIO_NUM 35
#define Y8_GPIO_NUM 34
#define Y7_GPIO_NUM 39
#define Y6_GPIO_NUM 36
#define Y5_GPIO_NUM 21
#define Y4_GPIO_NUM 19
#define Y3_GPIO_NUM 18
#define Y2_GPIO_NUM 5
#define VSYNC_GPIO_NUM 25
#define HREF_GPIO_NUM 23
#define PCLK_GPIO_NUM 22

const uint8_t flashLedPin = 4;

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
const bool useNewLedcApi = true;
#else
const bool useNewLedcApi = false;
const uint8_t flashLedChannel = 7;
#endif

WiFiClient mqttPlainClient;
WiFiClientSecure mqttTlsClient;
PubSubClient mqttClient(mqttPlainClient);
WebsocketsClient wsClient(std::make_shared<EspTlsSecuredTcpClient>(streamWsCaCert));
bool wsConnected = false;
bool mqttUsingInsecure = false;

String topicCmdLight;
String topicStateLight;
String topicStateOnline;
String topicStateHeartbeat;
String topicAck;

uint8_t currentLight = 0;
unsigned long lastWifiRetryTime = 0;
unsigned long lastMqttConnectAttempt = 0;
unsigned long lastHeartbeatTime = 0;
unsigned long lastWsConnectAttempt = 0;
unsigned long lastFrameTime = 0;
unsigned long lastStreamStatTime = 0;
unsigned long lastWsPingTime = 0;
unsigned long wsConnectedAt = 0;
unsigned long wsReconnectCount = 0;
unsigned long streamFramesSent = 0;
unsigned long streamFramesDropped = 0;
unsigned long streamBytesSent = 0;
unsigned long wsBusyDropCount = 0;
uint8_t currentJpegQuality = 0;
bool wifiWasConnected = false;
bool hasIPv6 = false;
String currentIPv6;
String currentIPv6Type = "NONE";
unsigned long lastIPv6TryTime = 0;
uint8_t ipv6TryCount = 0;
bool ipv6RetryExhaustedLogged = false;

void setup() {
  Serial.begin(115200);
  delay(150);
  Serial.println("\n--- ESP32-CAM MQTT + WS 推流启动 ---");
  printMemoryInfo("启动后");
  WiFi.onEvent(onWiFiEvent);

  setupTopics();
  setupFlashPwm();

  if (!initCamera()) {
    Serial.println("[BOOT] 摄像头初始化失败，5秒后重启");
    delay(5000);
    ESP.restart();
  }
  printMemoryInfo("摄像头初始化后");

  setupMqttTransport();
  mqttClient.setServer(mqttHost, mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);
  mqttClient.setKeepAlive(60);
  mqttClient.setSocketTimeout(15);

  wsClient.onEvent([](WebsocketsEvent event, String data) {
    (void)data;
    if (event == WebsocketsEvent::ConnectionOpened) {
      wsConnected = true;
      wsConnectedAt = millis();
      lastWsPingTime = millis();
      lastStreamStatTime = millis();
      streamFramesSent = 0;
      streamFramesDropped = 0;
      streamBytesSent = 0;
      wsBusyDropCount = 0;
      Serial.println("[WS] 推流连接成功");
    } else if (event == WebsocketsEvent::ConnectionClosed) {
      wsConnected = false;
      unsigned long aliveMs = (wsConnectedAt > 0) ? (millis() - wsConnectedAt) : 0;
      Serial.printf("[WS] 推流连接断开，在线时长=%lu ms, RSSI=%d\n", aliveMs, WiFi.RSSI());
    }
  });
  wsClient.addHeader("Origin", "https://esp.rose980.eu.cc");
  wsClient.addHeader("User-Agent", "ESP32-CAM");

  connectWiFi();
  if (WiFi.status() == WL_CONNECTED) {
    wifiWasConnected = true;
    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = millis();
      delay(1000);
      testInternet();
    }
    syncTimeIfNeeded();
  }

  connectMQTT();
  connectStreamWs();
}

void loop() {
  unsigned long now = millis();

