1033087886/esp32-cam/src/main.cpp
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiWasConnected) {
      wifiWasConnected = false;
      Serial.println("[WiFi] 已断开，等待重连");
      wsConnected = false;
      if (wsClient.available()) wsClient.close();
    }

    if (now - lastWifiRetryTime >= wifiReconnectInterval) {
      lastWifiRetryTime = now;
      connectWiFi();
    }

    delay(10);
    return;
  }

  if (!wifiWasConnected) {
    wifiWasConnected = true;
    Serial.printf("[WiFi] 重连成功，IP=%s\n", WiFi.localIP().toString().c_str());
    if (enablePortalAuth) {
      doPortalAuth();
      previousAuthTime = now;
      testInternet();
    }
    syncTimeIfNeeded();
  }

  if (enablePortalAuth && now - previousAuthTime >= authInterval) {
    previousAuthTime = now;
    Serial.println("[Portal] 认证间隔到期，执行续期认证");
    doPortalAuth();
  }

  if (!mqttClient.connected() && now - lastMqttConnectAttempt >= mqttReconnectInterval) {
    lastMqttConnectAttempt = now;
    connectMQTT();
  }

  if (!hasIPv6 && ipv6TryCount < ipv6MaxRetry && now - lastIPv6TryTime >= ipv6RetryInterval) {
    requestIPv6("loop-retry");
  } else if (!hasIPv6 && ipv6TryCount >= ipv6MaxRetry && !ipv6RetryExhaustedLogged) {
    ipv6RetryExhaustedLogged = true;
    Serial.println("[WiFi] IPv6 多次申请仍未成功，当前热点可能未向 STA 分配 IPv6");
  }

  if (mqttClient.connected()) {
    mqttClient.loop();
    if (now - lastHeartbeatTime >= mqttHeartbeatInterval) {
      lastHeartbeatTime = now;
      publishHeartbeat();
    }
  }

  if (!wsClient.available() && now - lastWsConnectAttempt >= wsReconnectInterval) {
    lastWsConnectAttempt = now;
    connectStreamWs();
  }

  wsClient.poll();
  sendStreamFrameIfReady();

  if (wsClient.available() && now - lastWsPingTime >= wsPingInterval) {
    if (!wsClient.ping()) {
      Serial.println("[WS] ping 失败，主动重连");
      wsClient.close();
      wsConnected = false;
    }
    lastWsPingTime = now;
  }
}

void setupTopics() {
  String base = String("esp32cam/") + deviceId;
  topicCmdLight = base + "/cmd/light";
  topicStateLight = base + "/state/light";
  topicStateOnline = base + "/state/online";
  topicStateHeartbeat = base + "/state/heartbeat";
  topicAck = base + "/ack";
}

void setupFlashPwm() {
  pinMode(flashLedPin, OUTPUT);

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    if (!ledcAttach(flashLedPin, 5000, 8)) {
      Serial.println("[LED] ledcAttach 初始化失败");
    }
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcSetup(flashLedChannel, 5000, 8);
    ledcAttachPin(flashLedPin, flashLedChannel);
#endif
  }

  setFlashBrightness(0, false);
}

void setFlashBrightness(uint8_t value, bool reportState) {
  currentLight = value;

  if (useNewLedcApi) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(flashLedPin, currentLight);
#endif
  } else {
#if !defined(ESP_ARDUINO_VERSION_MAJOR) || (ESP_ARDUINO_VERSION_MAJOR < 3)
    ledcWrite(flashLedChannel, currentLight);
#endif
  }

  Serial.printf("[LED] 当前亮度=%u\n", currentLight);

  if (reportState) {
    publishLightState();
  }
}

void publishLightState() {
  if (!mqttClient.connected()) return;

  String payload = String("{\"light\":") + String(currentLight) + ",\"pin\":" + String(flashLedPin) + "}";
  if (mqttClient.publish(topicStateLight.c_str(), payload.c_str(), true)) {
    Serial.println("[MQTT] 亮度状态: " + payload);
  }
}

void publishHeartbeat() {
  if (!mqttClient.connected()) return;

  String payload = "{";
  payload += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
  if (hasIPv6 && currentIPv6.length() > 0) {
    payload += "\"ipv6\":\"" + currentIPv6 + "\",";
    payload += "\"ipv6_type\":\"" + currentIPv6Type + "\",";
  }
  payload += "\"mac\":\"" + WiFi.macAddress() + "\",";
  payload += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  payload += "\"light\":" + String(currentLight);
  payload += "}";

  if (mqttClient.publish(topicStateHeartbeat.c_str(), payload.c_str(), false)) {
    Serial.println("[MQTT] 心跳: " + payload);
  }
}

void publishAck(const char* msg) {
  if (!mqttClient.connected()) return;
  mqttClient.publish(topicAck.c_str(), msg, false);
}

void setupMqttTransport() {
  if (!mqttUseTls) {
    mqttClient.setClient(mqttPlainClient);
    mqttUsingInsecure = true;
    Serial.println("[MQTT] 使用明文 TCP 模式（1883）");
    return;
  }

  mqttClient.setClient(mqttTlsClient);

  if (strstr(mqttCaCert, "PASTE_YOUR_CA_CERT_HERE") != nullptr) {
    mqttUsingInsecure = true;
    mqttTlsClient.setInsecure();
    Serial.println("[MQTT] TLS 未配置 CA，已启用 setInsecure");
  } else {
    mqttUsingInsecure = false;
    mqttTlsClient.setCACert(mqttCaCert);
    Serial.println("[MQTT] TLS 已加载 CA 证书");
  }
}

void syncTimeIfNeeded() {
  if (!mqttUseTls || mqttUsingInsecure) return;

  Serial.println("[NTP] 正在同步时间");
  configTime(0, 0, "ntp.aliyun.com", "pool.ntp.org", "time.google.com");

  time_t now = time(nullptr);
  int retry = 0;
  while (now < 1700000000 && retry < 20) {
    delay(500);
    Serial.print(".");
    now = time(nullptr);
    retry++;
  }

  if (now >= 1700000000) {
    Serial.printf("\n[NTP] 时间同步成功: %s", ctime(&now));
  } else {
    Serial.println("\n[NTP] 时间同步失败，TLS 校验可能失败");
  }
}

void onWiFiEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED: {
      requestIPv6("STA_CONNECTED");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP: {
      requestIPv6("STA_GOT_IP");
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_GOT_IP6: {
      refreshIPv6Status(true);
      ipv6RetryExhaustedLogged = false;
      break;
    }

    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      hasIPv6 = false;
      currentIPv6 = "";
      currentIPv6Type = "NONE";
      lastIPv6TryTime = 0;
      ipv6TryCount = 0;
      ipv6RetryExhaustedLogged = false;
      break;

    default:
      break;
  }
}

void requestIPv6(const char* reason) {
  if (WiFi.status() != WL_CONNECTED) return;
  bool ok = WiFi.enableIpV6();
  lastIPv6TryTime = millis();
  if (ipv6TryCount < 255) {
    ipv6TryCount++;
  }
  Serial.printf("[WiFi] IPv6 申请(%s): %s, 次数=%u\n", reason, ok ? "已发送" : "失败", ipv6TryCount);
}

