1033087886/esp32-cam/src/main.cpp
  bool sent = wsClient.sendBinary(reinterpret_cast<const char*>(fb->buf), fb->len);
  unsigned long sendMs = millis() - captureStart - captureMs;
  esp_camera_fb_return(fb);

  if (!sent) {
    streamFramesDropped++;
    wsBusyDropCount++;
    if (!wsClient.available()) {
      wsConnected = false;
    }
    if (wsBusyDropCount == 1 || (wsBusyDropCount % 50UL) == 0) {
      Serial.printf(
        "[WS] 发送忙，丢帧 busy=%lu (capture=%lums send=%lums, frame=%uB)\n",
        wsBusyDropCount,
        captureMs,
        sendMs,
        (unsigned int)frameBytes
      );
    }
    return;
  }

  wsBusyDropCount = 0;
  streamFramesSent++;
  streamBytesSent += frameBytes;

  if (frameBytes > streamPreferredMaxFrameBytes && currentJpegQuality < streamJpegQualityMax) {
    sensor_t* sensor = esp_camera_sensor_get();
    if (sensor != nullptr) {
      currentJpegQuality = static_cast<uint8_t>(currentJpegQuality + 1);
      if (currentJpegQuality > streamJpegQualityMax) {
        currentJpegQuality = streamJpegQualityMax;
      }
      sensor->set_quality(sensor, currentJpegQuality);
      Serial.printf(
        "[CAM] 帧过大=%uB，自动降低码率 quality=%u\n",
        (unsigned int)frameBytes,
        currentJpegQuality
      );
    }
  }

  if (now - lastStreamStatTime >= streamStatsInterval) {
    unsigned long window = now - lastStreamStatTime;
    float fps = (window > 0) ? (1000.0f * static_cast<float>(streamFramesSent) / static_cast<float>(window)) : 0.0f;
    float kbps = (window > 0) ? (8.0f * static_cast<float>(streamBytesSent) / static_cast<float>(window)) : 0.0f;
    Serial.printf(
      "[WS] 推流统计 fps=%.1f kbps=%.1f sent=%lu drop=%lu busy=%lu q=%u frame=%uB cap=%lums send=%lums\n",
      fps,
      kbps,
      streamFramesSent,
      streamFramesDropped,
      wsBusyDropCount,
      currentJpegQuality,
      (unsigned int)frameBytes,
      captureMs,
      sendMs
    );
    lastStreamStatTime = now;
    streamFramesSent = 0;
    streamFramesDropped = 0;
    streamBytesSent = 0;
  }

  lastFrameTime = now;
}

void printMemoryInfo(const char* stage) {
  const bool hasPsram = psramFound();
#if HAS_SPIRAM_CHIP_API
  const int chipEnum = static_cast<int>(esp_spiram_get_chip_size());
  Serial.printf(
    "[MEM] %s | PSRAM芯片探测(enum=%d, %s)\n",
    stage,
    chipEnum,
    psramChipSizeText(chipEnum)
  );
#endif
  Serial.printf(
    "[MEM] %s | PSRAM=%s, PSRAM总=%u, PSRAM可用=%u, Heap总=%u, Heap可用=%u\n",
    stage,
    hasPsram ? "可用" : "不可用",
    ESP.getPsramSize(),
    ESP.getFreePsram(),
    ESP.getHeapSize(),
    ESP.getFreeHeap()
  );
}

const char* psramChipSizeText(int chipEnum) {
  switch (chipEnum) {
    case 0: return "16Mbit (2MB)";
    case 1: return "32Mbit (4MB)";
    case 2: return "64Mbit (8MB)";
    default: return "INVALID/UNKNOWN";
  }
}
